[
    {
      "id": "dar-al-madinah-museum",
      "title": "Dar al-Madinah Museum",
      "shortDescription": "The Museum of Madinah Urban and Civilizational Heritage (opened 2011) showcasing Medina’s history from the Prophet’s era to today&#8203;:contentReference[oaicite:16]{index=16}.",
      "fullDescription": "Dar al-Madinah is a modern museum opened in 2011 that traces the history and heritage of Medina&#8203;:contentReference[oaicite:17]{index=17}. Exhibits include life-size models of Masjid an-Nabawi, the Prophet’s homelands, rare manuscripts, and artifacts related to early Islamic culture. Organized chronologically, the museum displays Medina’s urban development from the 7th century onward. It is considered the city’s first specialized heritage museum, aiming to educate visitors on Medina’s legacy through interactive exhibits.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "hejaz-railway-station",
      "title": "Hejaz Railway Museum (Historic Station)",
      "shortDescription": "The Ottoman-era Hejaz Railway station in Medina, now a railway museum (opened 2006) displaying historic locomotives and rail artifacts.",
      "fullDescription": "The Hejaz Railway Station was built in 1908–1916 under Ottoman Sultan Abdulhamid II as part of the Damascus-Medina line. The Medina station building has been restored and converted into the Hejaz Railway Museum (opened in 2006). On its grounds are original steam engines, track segments, and cars from the historic railway. Exhibits explain the construction of the railway and its role in facilitating Hajj pilgrimages under the Ottomans.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "dates-market",
      "title": "Medina Dates Market (Souq al-Atṭār)",
      "shortDescription": "A bustling market near the Prophet’s Mosque selling premium local dates (especially Ajwa) and Islamic prayer items.",
      "fullDescription": "Just outside the mosque, the Date Market (Souq al-Atṭār) is a lively traditional bazaar. Vendors here sell Medina’s famous dates – notably sweet Ajwa and Sukkari varieties – along with nuts, spices, and religious souvenirs. Ajwa dates are particularly prized: the Prophet ﷺ said eating seven Ajwa dates every morning protects one for the day&#8203;:contentReference[oaicite:18]{index=18}. Shoppers also find prayer beads, small Qur’ans, and fragrances. The market’s vibrant atmosphere reflects Medina’s hospitality culture.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "madinah-media-museum",
      "title": "Madinah Media Museum",
      "shortDescription": "A small multimedia museum on King Abdul Aziz Road featuring models and exhibits about the Prophet’s Mosque and city history.",
      "fullDescription": "Located adjacent to Masjid an-Nabawi, the Medina Media Museum offers interactive displays on the history of the Prophet’s Mosque and Medina. Its basement houses scale models, maps of early battles, and a small theater showing the mosque’s development. For example, visitors can see the layout of Masjid an-Nabawi at different periods and the Prophet’s house. Guides often accompany groups to explain the context behind each exhibit. Though modest in size, it provides insight into Medina’s past for families and enthusiasts.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "king-fahd-quran-printing",
      "title": "King Fahd Quran Printing Complex",
      "shortDescription": "The government-run printing complex (founded 1985) in Medina that produces millions of copies of the Qur’an in Arabic and many languages&#8203;:contentReference[oaicite:19]{index=19}.",
      "fullDescription": "The King Fahd Complex for the Printing of the Holy Qur’an is a large facility in Medina established in 1985. It publishes the standard Medina Mushaf and has produced over 128 million copies of the Qur’an to date&#8203;:contentReference[oaicite:20]{index=20}. The complex also prints translations in dozens of languages and offers an online Qur’an platform. Its emphasis on mass distribution makes Medina a global center for Qur’anic publishing. Visitors can tour parts of the facility (by arrangement) to see presses and calligraphy studios.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "shopping-areas",
      "title": "Shopping Areas (Taiba Center, etc.)",
      "shortDescription": "Commercial hubs near the mosque such as Taiba Center (Gate 20) offering souvenirs, abayas, perfumes, and daily necessities.",
      "fullDescription": "Madina’s main shopping district lies around Masjid an-Nabawi. The Taiba Commercial Center (outside Gate 20) and nearby markets are popular with pilgrims. These areas feature shops selling Islamic books, prayer rugs, replica Zamzam bottles, and local handicrafts. Clothing stores (for abayas and thawbs), perfume shops, electronics and travel goods are all found here. The souks stay open late for worshippers leaving evening prayers, blending traditional market stalls with modern convenience.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "mount-uhud-visitor-area",
      "title": "Mount Uhud Visitor Area",
      "shortDescription": "Recreational park and museum at the foot of Mount Uhud, commemorating the Battle of Uhud with paths, displays, and memorials.",
      "fullDescription": "At the base of Mount Uhud, a visitor complex and park have been developed. There are informational panels and a small museum explaining the Battle of Uhud and its significance. Walking trails lead up to viewpoints on the mountain. The Sayyid Ash-Shuhadāʾ Mosque (Hamza Mosque) stands in this area marking the burial of Hamza and other martyrs&#8203;:contentReference[oaicite:21]{index=21}. The site is landscaped for pilgrims to relax and learn history after climbing the battle site.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "seven-mosques",
      "title": "The Seven Mosques (Sabʿat al-Masājid)",
      "shortDescription": "A complex of small historic mosques south of Mount Salaʿ, each linked to a defender in the Battle of the Trench&#8203;:contentReference[oaicite:22]{index=22}.",
      "fullDescription": "The Seven Mosques are a cluster of six (traditionally called seven) small mosques near Mount Salaʿ in Medina. They are named after companions who stood guard during the Battle of the Trench in 627 CE&#8203;:contentReference[oaicite:23]{index=23}. Al-Fatḥ Mosque is the largest; the others (e.g. Abu Lubabah Mosque) are adjacent. According to tradition, each mosque marks the station of a warrior defending the city’s southern flank. Today these simple brick structures are visited by pilgrims who want to honor those defenders and connect with Medin’s early Islamic history.",
      "image": "",
      "heroImage": "",
      "gallery": []
    }
  ]
  