[
    {
      "id": "rawdah",
      "title": "Al-Rawdah Ash-Sharifah (Riyad al-Jannah)",
      "shortDescription": "The Rawdah is the area between the Prophet’s tomb and his pulpit, revered as part of Paradise&#8203;:contentReference[oaicite:0]{index=0}.",
      "fullDescription": "The Rawdah Ash-Sharifah is the chamber between the minbar and the burial chamber of Prophet Muhammad ﷺ. According to tradition, the Prophet said, “The area between my house and my minbar is one of the gardens of Paradise,” making it an especially blessed prayer space. It is carpeted in green to mark its special status.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "minarets",
      "title": "Minarets",
      "shortDescription": "The mosque has ten tall minarets (each about 104 meters high), built in successive expansions and topped with Ottoman-style finials.",
      "fullDescription": "The original minarets were erected by Caliph al-Walid I (ruled 705–715 CE) in wood (circa 707–709 CE). The current complex now has ten soaring minarets (each around 104 m tall) added in modern Saudi expansions. These blend Ottoman architectural motifs with contemporary engineering to dominate the city’s skyline.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "green-dome",
      "title": "Green Dome",
      "shortDescription": "The famous green-painted dome over the Prophet’s burial chamber, built in 1279–80 CE by the Mamluk Sultan Qalawun and first painted green in 1837.",
      "fullDescription": "The Green Dome (Qubbah al-Khaḍrāʼ) crowns the southeast corner of Masjid an-Nabawi above Muhammad ﷺ’s tomb. It was originally constructed of wood in 1279/80 CE by Mamluk Sultan al-Mansur Qalawun. After various rebuildings and a fire in 1481 CE, the current brick-and-wood dome was installed in 1818 under Ottoman Sultan Mahmud II and painted green in 1837, giving it its distinctive color and name.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "prophet-grave",
      "title": "Prophet’s Grave",
      "shortDescription": "The chamber containing the tomb of Prophet Muhammad ﷺ (and, behind him, the graves of Caliphs Abu Bakr and Umar).",
      "fullDescription": "Inside the Green Dome lies the burial chamber of Prophet Muhammad ﷺ. It was originally part of his residence (Aisha’s house) in the mosque. Abu Bakr and Umar (the first two Caliphs and the Prophet’s fathers-in-law) were buried next to him here. Aisha lived in the adjacent chamber with no barrier between her home and the Prophet’s grave. The graves remain enclosed behind a grille; visitors only pray at the doorway of the chamber as it contains the Prophet’s rawah (resting place).",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "minbar",
      "title": "Minbar (Pulpit)",
      "shortDescription": "The wooden pulpit from which the Prophet ﷺ delivered sermons, replaced by an Ottoman minbar in 1590 CE.",
      "fullDescription": "The Prophet’s Mosque originally had a simple pulpit; in 998 AH (1590 CE), Sultan Murad III of the Ottoman Empire installed the finely carved wooden minbar that stands today. It has twelve steps leading to a pointed arch canopy. The current minbar replaced an earlier simple one but occupies the same historic spot from which the Prophet ﷺ preached, so it is often still called the Prophet’s Minbar.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "mihrab",
      "title": "Mihrab",
      "shortDescription": "The prayer niche indicating the qibla. The mosque’s earliest mihrab dates to Caliph Uthman’s reign, marking the switch from Jerusalem to Mecca.",
      "fullDescription": "The principal mihrab (qibla niche) of Masjid an-Nabawi was established during the reign of Caliph Uthman ibn Affan. This became the official spot facing the Kaaba in Mecca, replacing the earlier Jerusalem-facing qibla. The mihrab is ornately decorated and serves as the focal point of the qibla wall. It has been updated during later expansions but remains aligned with the Prophet’s original prayer direction as commanded in the Quran.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "bab-jibril",
      "title": "Bab Jibril (Gate of Gabriel)",
      "shortDescription": "An eastern gate of the mosque named because Angel Gabriel is believed to have entered through it.",
      "fullDescription": "Bab Jibril (Gate of Gabriel) is located on the eastern side of the Ottoman prayer hall. Tradition holds that the Angel Gabriel entered the Prophet’s Mosque through this entrance to convey revelations to Muhammad ﷺ. It sits between other historic eastern portals and retains its name despite having been relocated during various expansions. Its decorative style reflects 19th/20th-century Ottoman and Saudi renovations.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "bab-as-salam",
      "title": "Bab as-Salam",
      "shortDescription": "The “Gate of Peace,” one of the mosque’s largest Ottoman-era gates, located at the northwest corner of the old prayer hall&#8203;:contentReference[oaicite:1]{index=1}.",
      "fullDescription": "Bab as-Salam (Gate of Peace) was originally erected on the western wall of the mosque during Caliph ʿUmar’s time (642 CE)&#8203;:contentReference[oaicite:2]{index=2}. It became integrated into the Ottoman prayer hall. Today, its grand arch and calligraphy face the northwest. The gate’s modern decoration dates from the Saudi expansion, but it preserves the historic name and legacy of being a major entrance to the mosque.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "other-gates",
      "title": "Other Gates",
      "shortDescription": "Other historic entrances include Bab Abu Bakr and Bab al-Raḥmah (south), Bab al-Hijrah (east), Bab Qubā (north) and newer Saudi-era portals, each reflecting different expansion periods.",
      "fullDescription": "Numerous additional gates surround Masjid an-Nabawi. On the south stands Bab Abu Bakr and Bab al-Raḥmah, dating back to early Caliphate expansions. To the east is Bab al-Hijrah (Migration), linked to the Hijrah, and Bab Qubā. Modern Saudi additions include Bab al-Aiwad and others used by pilgrims. Each gate carries inscriptions of its construction and has unique architectural details from Ottoman, and contemporary periods.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "roof-and-floors",
      "title": "Roof and Upper Floors",
      "shortDescription": "A multi-level roof system with retractable domes and giant mechanical umbrellas covering the courtyard.",
      "fullDescription": "Masjid an-Nabawi’s roof is an elaborate structure of layered domes and canopies. The outdoor courtyard is shaded by dozens of giant foldable umbrellas (250 units) that open automatically to protect worshippers from heat. Inside, sliding glass domes allow sunlight into the main hall. Stairs, ramps and escalators connect the various floors, reflecting the extensive Saudi-era expansion of the 1980s–90s which created multiple prayer galleries.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "women-prayer-area",
      "title": "Women’s Prayer Area",
      "shortDescription": "Dedicated multi-level halls and galleries reserved for female worshippers, separated from the main hall by partitions.",
      "fullDescription": "In the modern expansions of Masjid an-Nabawi, large separate prayer halls on the upper levels were built for women. These areas allow women to perform prayers simultaneously with the men below, using their own mihrab and minbar. The women’s sections are integrated into the structure but enclosed by walls or screens to maintain privacy. During peak times, women may also pray in designated zones near the back of the main hall, though the Rawdah area remains open only to men.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "old-prayer-chamber",
      "title": "Al-Hujra ash-Sharifah (Old Prayer Chamber)",
      "shortDescription": "The Prophet’s private quarters (his house, where he lived with Aisha and passed away) now enclosed inside the mosque.",
      "fullDescription": "The “Sacred Chamber” was the room where Muhammad ﷺ lived during the final years of his life. Aisha and some wives resided here, and the Prophet ﷺ often prayed and taught inside it. He passed away in this chamber. Afterward, it was incorporated into Masjid an-Nabawi and later became part of the burial chamber. Today it is a small roofed room on the mosque’s eastern side, preserved through renovations but closed to general access.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "burial-chamber",
      "title": "Burial Chamber",
      "shortDescription": "Enclosed chamber under the Green Dome containing the graves of the Prophet ﷺ, Abu Bakr and Umar.",
      "fullDescription": "The Burial Chamber is the small marble-enclosed room beneath the Green Dome that houses the tombs of Prophet Muhammad ﷺ, Abu Bakr and Umar. Muhammad ﷺ is in the southeastern corner of this chamber, with Abu Bakr’s grave immediately behind him and Umar’s to one side. Aisha had permitted these burials to occur next to her husband, so no wall divides the graves. The chamber has simple marble walls and a grated gateway; visitors honor the Prophet by standing at its outer entrance and offering salutations.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "historical-architecture",
      "title": "Historical Architecture",
      "shortDescription": "The mosque’s structure reflects Ottoman, Mamluk and modern Saudi styles – e.g. Sultan Qalawun’s 13th-century domes, Ottoman minaret and minbar, and 20th-century expansions.",
      "fullDescription": "Al-Masjid an-Nabawi has been rebuilt and expanded many times. Key elements include the Mamluk-era Qalawun Dome (built 1279–80 CE), the Ottoman minbar of 1590 CE, and the massive concrete wings and minarets added by Saudi kings in the 20th century. Ottoman features like high arches and ornate tile work blend with simple modern expansions. The result is a layered historical tapestry: the modest original mosque gave way to an imperial mosque under the Ottomans, and today a sprawling multi-storied complex befitting one of Islam’s holiest sites.",
      "image": "",
      "heroImage": "",
      "gallery": []
    }
  ]
  