[
    {
      "id": "kaaba",
      "title": "Kaaba",
      "shortDescription": "The Kaaba is a cube-shaped stone building at the center of Masjid al-Haram in Mecca, Saudi Arabia. It is Islam’s holiest shrine, regarded by Muslims as the \"House of God\" and the qibla (direction of prayer) for the Muslim world&#8203;:contentReference[oaicite:0]{index=0}.",
      "fullDescription": "According to Islamic tradition, the Kaaba was originally built by the Prophet Ibrahim (Abraham) and his son Ismail. The current structure (approximately 13 m high) was rebuilt in the 7th century CE after earlier damage. The Kaaba is draped in a black silk and gold-embroidered cloth called the Kiswa, which is replaced annually. Pilgrims perform tawaf (circumambulation) around the Kaaba during Hajj and Umrah. Its four corners roughly align with the cardinal directions. The Kaaba has been rebuilt multiple times in history, but remains the symbolic center of the Grand Mosque&#8203;:contentReference[oaicite:1]{index=1}.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "hajar-al-aswad",
      "title": "Black Stone (Hajr al-Aswad)",
      "shortDescription": "The Black Stone is an ancient Islamic relic set into the eastern corner of the Kaaba. It is revered by Muslims and pilgrims often attempt to kiss or touch it during tawaf. Tradition holds that the Prophet Muhammad set the Black Stone in the Kaaba’s wall in 605 CE&#8203;:contentReference[oaicite:2]{index=2}&#8203;:contentReference[oaicite:3]{index=3}.",
      "fullDescription": "According to tradition, the Black Stone dates back to the time of Adam and Eve and was venerated in pre-Islamic times. Today it consists of several dark fragments cemented together within a silver frame on the Kaaba’s corner&#8203;:contentReference[oaicite:4]{index=4}. During Hajj and Umrah, many pilgrims strive to kiss or touch the Black Stone, emulating the Prophet Muhammad who is reported to have kissed it&#8203;:contentReference[oaicite:5]{index=5}&#8203;:contentReference[oaicite:6]{index=6}. Islamic scholars emphasize that while the Black Stone is a cherished symbol, it has no divine power of its own.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "maqam-ibrahim",
      "title": "Maqam Ibrahim (Station of Abraham)",
      "shortDescription": "The Maqam Ibrahim is a small stone associated with Prophet Abraham in Masjid al-Haram. Islamic tradition holds that Abraham stood on this stone when building the Kaaba, imprinting his footsteps on it&#8203;:contentReference[oaicite:7]{index=7}.",
      "fullDescription": "The Maqam Ibrahim (Arabic: مقام إبراهيم) is encased in a golden-metal enclosure near the Kaaba. It is said to bear the footprints of Abraham, which were miraculously imprinted when he stood upon it during the construction of the Kaaba&#8203;:contentReference[oaicite:8]{index=8}. After circumambulating the Kaaba, pilgrims often perform two units of prayer near the Maqam Ibrahim, as instructed in the Quran (2:125), reflecting its sacred association with Abraham&#8203;:contentReference[oaicite:9]{index=9}.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "zamzam-well",
      "title": "Zamzam Well",
      "shortDescription": "The Zamzam Well is a sacred well located within the Masjid al-Haram, about 20 meters east of the Kaaba. It is believed to have miraculously provided water to Hagar and her son Ishmael in the desert thousands of years ago&#8203;:contentReference[oaicite:10]{index=10}.",
      "fullDescription": "According to Islamic legend, the spring of Zamzam opened when the Prophet Ibrahim’s son Ishmael was left thirsty in the desert with his mother Hagar. The well dried up and was rediscovered in the 6th century by Abdul-Muttalib, the grandfather of the Prophet Muhammad&#8203;:contentReference[oaicite:11]{index=11}. Today Zamzam water is drawn from a well beneath the mosque, and pilgrims believe it to have blessed and healing properties. Drinking Zamzam water is a recommended practice during pilgrimage.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "safa-and-marwa",
      "title": "Safa and Marwa",
      "shortDescription": "Safa and Marwa are two small hills now enclosed within the Masjid al-Haram complex. In Islamic tradition, Hagar ran between these hills seven times searching for water, a ritual remembered by pilgrims performing Sa’i (walking/running) between Safa and Marwa during Hajj and Umrah&#8203;:contentReference[oaicite:12]{index=12}.",
      "fullDescription": "The two white-capped hills of Safa (to the south) and Marwa (to the north) are connected by the Sa’i gallery inside the mosque. Muslims reenact Hagar’s actions by traveling seven times back and forth between Safa and Marwa. This path (called the Mas’a) is now fully roofed within the mosque. Both Safa and Marwa are explicitly mentioned in the Quran (Surah Al-Baqarah 2:158) and form an integral part of the pilgrimage rites&#8203;:contentReference[oaicite:13]{index=13}.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "multazam",
      "title": "Multazam",
      "shortDescription": "The Multazam is the approximately 2-meter-wide area of the Kaaba’s wall between the Black Stone and the Kaaba’s door. It is regarded as a special place for du’a (supplication), where prayers are considered especially likely to be answered&#8203;:contentReference[oaicite:14]{index=14}.",
      "fullDescription": "Situated on the Kaaba’s eastern face, the Multazam (Arabic: ملتزم) is where pilgrims press their face, hands, and chest against the wall and make du’a. It has been narrated that supplications made at the Multazam are granted. Several hadiths note that the Prophet Muhammad prayed and supplicated in this spot, and that prayers offered here will certainly be answered&#8203;:contentReference[oaicite:15]{index=15}. It is thus a focal point for personal prayers and devotion during tawaf.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "hijr-ismail",
      "title": "Hijr Ismail (Hatim)",
      "shortDescription": "The Hijr Ismail (also known as Hatim) is a low semi-circular wall adjacent to the Kaaba’s north-west side. It marks the boundary of what was originally part of the Kaaba&#8203;:contentReference[oaicite:16]{index=16}.",
      "fullDescription": "Originally, the area between this wall and the Kaaba wall was part of the Kaaba structure. Now it stands as a semi-circular enclosure paved with marble. It is traditionally believed that the Prophet Abraham’s wife Hagar and son Ishmael are buried in the Hijr Ismail area. Praying inside this enclosed space is considered equivalent to performing one extra circuit of tawaf. According to the source, it measures about 1.5 m wide and 1.3 m high&#8203;:contentReference[oaicite:17]{index=17}. Pilgrims often seek to pray in this revered spot.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "mizab-al-rahmah",
      "title": "Mizab al-Rahmah (Water Spout of Mercy)",
      "shortDescription": "The Mizab al-Rahmah is the golden rain gutter projecting from the roof of the Kaaba at its north-west corner. It channels rainwater from the Kaaba’s roof to the ground below&#8203;:contentReference[oaicite:18]{index=18}.",
      "fullDescription": "Literally 'Spout of Mercy', the Mizab al-Rahmah is a gilded water spout attached to the Kaaba’s roof. Its design has evolved over the centuries; the current spout is gold-plated copper. Tradition holds that the area under the Mizab is especially blessed: prayers uttered under its flowing water are believed to be answered by God&#8203;:contentReference[oaicite:19]{index=19}&#8203;:contentReference[oaicite:20]{index=20}. The ground beneath the Mizab is often kept dry and clean and is considered a sacred spot for supplication.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "rukn-al-yamani",
      "title": "Rukn al-Yamani",
      "shortDescription": "Rukn al-Yamani, the Yemeni Corner, is the corner of the Kaaba facing southwest (toward Yemen). It is one of the Kaaba’s four corners, traditionally touched by pilgrims during tawaf&#8203;:contentReference[oaicite:21]{index=21}.",
      "fullDescription": "The Rukn al-Yamani forms the lower south-western corner of the Kaaba. Unlike the Black Stone corner, it has no embedded stone; instead, it is plain and made of marble. Many pilgrims seek to kiss or touch the Yemeni corner during tawaf as a sign of reverence, following traditions of the Prophet. It lies under the lower edge of the Kaaba’s drapery (hizam), and standing near it while making du’a is considered meritorious in some traditions.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "maqsurah-kaaba",
      "title": "Maqsurah of the Kaaba",
      "shortDescription": "The Maqsurah of the Kaaba was a screened enclosure built around the Kaaba, traditionally reserved for Muslim rulers and dignitaries. It served to protect the ruler or imam during prayer&#8203;:contentReference[oaicite:22]{index=22}.",
      "fullDescription": "In early Islamic architecture, a maqsurah is a protected enclosure near the qibla wall of a mosque, reserved for the ruler. Historically, the Kaaba had a maqsura–a wooden or stone fence–surrounding it so that only certain people (such as the caliph or governor) could approach closely. Over time, as the mosque was expanded, the separate enclosure was removed and incorporated into the open prayer area. Today the plaza around the Kaaba is open to all worshippers.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "mihrab-and-minbar",
      "title": "Mihrab and Minbar",
      "shortDescription": "The Grand Mosque’s main prayer hall contains a decorated mihrab (a niche indicating the qibla) and the imam’s minbar (pulpit). The mihrab’s orientation points toward the Kaaba, and the minbar is where sermons (khutbahs) are delivered&#8203;:contentReference[oaicite:23]{index=23}.",
      "fullDescription": "Within the Masjid al-Haram’s large prayer areas, the imam leads prayers facing the Kaaba. A beautifully ornamented mihrab is built into the wall to indicate the qibla (direction of prayer). Beside it is the minbar, a stepped wooden or marble pulpit from which the imam delivers the Friday sermon. These elements date from modern renovations of the mosque; they are richly decorated and aligned so that worshippers face the Kaaba as commanded in Islamic tradition&#8203;:contentReference[oaicite:24]{index=24}.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "al-buraq-wall",
      "title": "Al-Buraq Wall",
      "shortDescription": "Al-Buraq Wall is traditionally believed to be the spot in Masjid al-Haram where Prophet Muhammad tied his steed Al-Buraq before embarking on the Night Journey (Isra and Mi'raj). Pilgrims respect this site due to its association with the Prophet’s miraculous journey.",
      "fullDescription": "According to Islamic tradition, on the night of Isra and Mi'raj the Prophet Muhammad tied his winged steed Al-Buraq at this corner of the Grand Mosque before traveling to Jerusalem. The exact historic location has been commemorated by a pillar or marker near the mosque’s northwestern wall. Pilgrims often reflect on this event when near the Kaaba. The focus, however, remains on the central rites of worship, and no formal ritual is performed specifically at the Buraq wall today.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "minarets",
      "title": "Minarets",
      "shortDescription": "Minarets are the tall towers of a mosque, traditionally used for the call to prayer. Masjid al-Haram originally had a few minarets, but modern expansions have increased the total to eleven (11) as of today&#8203;:contentReference[oaicite:25]{index=25}&#8203;:contentReference[oaicite:26]{index=26}.",
      "fullDescription": "Throughout history, the mosque’s minarets have been added in stages. Ottoman renovations in the 16th-17th centuries brought the total to seven minarets&#8203;:contentReference[oaicite:27]{index=27}. Later Saudi expansions added four more, bringing the total to eleven&#8203;:contentReference[oaicite:28]{index=28}. Each minaret has a narrow balcony and is topped with an illuminated crescent, which is lit at night. The minarets contribute to the mosque’s striking skyline and serve both practical (adhan/iqama) and symbolic roles in Islamic architecture.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "upper-floors",
      "title": "Upper Floors and Roof Areas",
      "shortDescription": "Modern expansions of the Grand Mosque have built multiple levels of prayer space above ground. New upper floors and roof terraces were added to accommodate more worshippers&#8203;:contentReference[oaicite:29]{index=29}.",
      "fullDescription": "Beginning in the late 20th century, Saudi expansion projects enlarged Masjid al-Haram vertically. The 2011 expansion under King Abdullah introduced a multi-level extension on the mosque’s north side&#8203;:contentReference[oaicite:30]{index=30}. These floors are connected by staircases, escalators, and elevators, and provide additional prayer halls. Some flat roof areas on these upper levels are used as open-air prayer spaces during peak times (especially Hajj), greatly increasing the mosque’s capacity.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "elevators",
      "title": "Elevators",
      "shortDescription": "Masjid al-Haram is equipped with many modern high-capacity elevators that transport worshippers between its levels. These lifts were added as part of recent expansion projects to improve accessibility.",
      "fullDescription": "Over 20 large elevators operate in the Grand Mosque, moving pilgrims from the ground level to upper prayer floors and the roof. They are housed in the new multi-story extension buildings. The elevators complement escalators and ramps, facilitating the movement of elderly and disabled pilgrims. During peak periods, these lifts handle tens of thousands of people per hour, dramatically improving crowd circulation.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "escalators",
      "title": "Escalators",
      "shortDescription": "The Grand Mosque contains a network of escalators to aid pilgrim movement. Hundreds of escalators were added in recent expansions to connect different floors, including the Safa-Marwa gallery&#8203;:contentReference[oaicite:31]{index=31}.",
      "fullDescription": "These moving staircases link the courtyard and prayer floors. In total, over 200 escalators have been installed throughout Masjid al-Haram, enabling pilgrims to reach upper levels without climbing stairs&#8203;:contentReference[oaicite:32]{index=32}. The addition of escalators (alongside elevators) during the 1990s and 2000s greatly improved flow, especially during the Hajj season, by allowing large crowds to move efficiently between floors and to the Safa and Marwa areas.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "entrance-gates",
      "title": "Entrance Gates",
      "shortDescription": "Masjid al-Haram has dozens of monumental entrance gates around its perimeter. Modern expansions added 18 new gates (each with a decorative dome) to the mosque&#8203;:contentReference[oaicite:33]{index=33}.",
      "fullDescription": "Historically the Great Mosque had only a few entry points, but Saudi enlargement projects vastly increased the number of gates. In the 1980s expansion, 18 new domed gates were built&#8203;:contentReference[oaicite:34]{index=34}. Notable gates include King Abdulaziz Gate, King Fahd Gate, King Salman Gate, and others named for kings or virtues. Each gate features a large arch or dome and leads directly into the mosque’s prayer halls or courtyards. The added gates improve access and help distribute crowds entering the mosque.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "expansion-projects",
      "title": "Expansion Projects",
      "shortDescription": "Masjid al-Haram has undergone multiple major expansions to accommodate the growing number of pilgrims. Key projects under King Fahd (1982–1988) and King Abdullah (2008–2015) greatly enlarged the mosque’s area and capacity&#8203;:contentReference[oaicite:35]{index=35}&#8203;:contentReference[oaicite:36]{index=36}.",
      "fullDescription": "The second Saudi expansion (1980s) under King Fahd added a massive new wing and outdoor prayer areas, connected to the mosque by the King Fahd Gate&#8203;:contentReference[oaicite:37]{index=37}. The King Abdullah expansion extended the mosque’s northern side, adding multiple floors, broad stairways, tunnels, and two new minarets&#8203;:contentReference[oaicite:38]{index=38}. These projects tripled the mosque’s size (to over 350,000 m²) and increased its capacity to over two million worshippers. They also included modern infrastructure like air conditioning, lighting, and crowd-control systems to serve the vast crowds.",
      "image": "",
      "heroImage": "",
      "gallery": []
    }
  ]
  