[
    {
      "id": "rawdah",
      "title": "Al-Rawdah Ash-Sharifah (Riyad al-Jannah)",
      "shortDescription": "The Rawdah is the area between the Prophet’s tomb and his pulpit, revered as part of Paradise&#8203;:contentReference[oaicite:0]{index=0}.",
      "fullDescription": "The Rawdah Ash-Sharifah, often referred to as Rawdat al-Jannah (Garden of Paradise), is one of the most sacred areas within Al-Masjid an-Nabawi (the Prophet's Mosque) in Madinah, Saudi Arabia. It lies between the Prophet Muhammad ﷺ’s house (which now contains his blessed grave) and his minbar (pulpit). The Prophet ﷺ said in an authentic hadith, “What is between my house and my minbar is a garden from the gardens of Paradise” (Bukhari and Muslim), which signifies the immense spiritual value of this space. Due to this hadith, Muslims believe that praying in this area brings immense reward and spiritual benefit. The Rawdah is distinctively marked with a green carpet, setting it apart from the red carpets in the rest of the mosque.",
      "fullDescription2":"The Rawdah is also considered a place where duas (supplications) are more likely to be accepted, and many pilgrims try to pray there at least once during their visit to Madinah. Because of its limited space and great significance, it often becomes very crowded, especially during Hajj and Umrah seasons. The area includes historical landmarks such as the original location of the Prophet’s house and the first minbar used in Islamic sermons. Visiting and praying in the Rawdah is seen not just as a physical act, but a deeply spiritual one that connects a believer to the early days of Islam and to the Prophet ﷺ himself.",
      "image": "../images/madina/AlRawdahSharifah/AlRawdahSharifah1.jpg",
      "heroImage": "../images/madina/AlRawdahSharifah/AlRawdahSharifah1.jpg",
      "gallery": ["../images/madina/AlRawdahSharifah/AlRawdahSharifah3.jpg","../images/madina/AlRawdahSharifah/AlRawdahSharifah4.jpg","../images/madina/AlRawdahSharifah/AlRawdahSharifah2.jpg","../images/madina/AlRawdahSharifah/AlRawdahSharifah6.jpg","../images/madina/AlRawdahSharifah/AlRawdahSharifah1.jpg"]
    },
    {
      "id": "minarets",
      "title": "Minarets",
      "shortDescription": "The mosque has ten tall minarets (each about 104 meters high), built in successive expansions and topped with Ottoman-style finials.",
      "fullDescription": "The original minarets of Al-Masjid an-Nabawi were commissioned by Caliph al-Walid I during the early 8th century (around 707–709 CE) and were made of wood, marking the first architectural elevation of the mosque. Over the centuries, various Islamic dynasties—such as the Abbasids, Mamluks, and Ottomans—expanded and renovated the mosque, adding more elaborate and durable minarets using stone and brick. The current structure, as part of the modern Saudi expansions, now features ten striking minarets, each approximately 104 meters (341 feet) tall. These minarets are a blend of Ottoman decorative elements, like arched balconies and muqarnas, with modern construction techniques, such as reinforced concrete and precision stonework. They not only serve a functional purpose—calling the faithful to prayer—but also stand as iconic visual symbols of Madinah, visible from miles away and forming an integral part of the city’s spiritual and architectural identity.",
      "image": "../images/madina/minarets/minarets1.jpg",
      "heroImage": "../images/madina/minarets/minarets2.jpg",
      "gallery": ["../images/madina/minarets/minarets3.jpg","../images/madina/minarets/minarets4.jpg","../images/madina/minarets/minarets5.jpg","../images/madina/minarets/minarets6.jpg","../images/madina/minarets/minarets1.jpg"]
    },
    {
      "id": "green-dome",
      "title": "Green Dome",
      "shortDescription": "The famous green-painted dome over the Prophet’s burial chamber, built in 1279–80 CE by the Mamluk Sultan Qalawun and first painted green in 1837.",
      "fullDescription": "The Green Dome (Qubbah al-Khaḍrāʼ) is one of the most iconic and emotionally significant landmarks in Islam, located above the sacred burial chamber of Prophet Muhammad ﷺ, and his two closest companions, Abu Bakr as-Siddiq (RA) and Umar ibn al-Khattab (RA), in the southeast corner of Al-Masjid an-Nabawi. The original dome was constructed in 1279/80 CE by the Mamluk Sultan al-Mansur Qalawun, using wood to enclose and honor the Prophet’s resting place. Over the centuries, the dome suffered structural issues and even a devastating fire in 1481, which damaged the mosque and required extensive renovations. The tomb below, however, miraculously remained unharmed. Subsequent rulers and Islamic dynasties treated the dome with great reverence, often upgrading its structure and reinforcing its significance.",
      "fullDescription2":"In 1818, during the reign of Ottoman Sultan Mahmud II, the current version of the dome was rebuilt using brick and wood, offering greater durability and resilience. It was finally painted green in 1837, during the later Ottoman period, and has since been known as the Green Dome, or Qubbah al-Khaḍrāʼ, a symbol recognized by Muslims worldwide. Though the dome is not an obligatory part of Islamic belief, its spiritual and historical symbolism deeply resonates with millions of believers. Today, pilgrims often gather near the area to send salawat (blessings) upon the Prophet ﷺ and reflect on the profound legacy of Islam's most revered figure. The dome remains untouched by any changes inside the mosque’s prayer area, preserving its sacred aura as a powerful reminder of Islamic heritage.",
      "image": " ../images/madina/greendome/greendome1.jpg",
      "heroImage": "../images/madina/greendome/greendome2.jpg",
      "gallery": [" ../images/madina/greendome/greendome3.jpg"," ../images/madina/greendome/greendome4.jpg"," ../images/madina/greendome/greendome5.jpg"," ../images/madina/greendome/greendome6.jpg"," ../images/madina/greendome/greendome1.jpg"]
    },
    {
      "id": "bab-jibril",
      "title": "Bab Jibril (Gate of Gabriel)",
      "shortDescription": "An eastern gate of the mosque named because Angel Gabriel is believed to have entered through it.",
      "fullDescription": "Bab Jibril (Gate of Gabriel) is one of the most historically and spiritually significant entrances of Masjid an-Nabawi, located on the eastern side of the Ottoman prayer hall. According to Islamic tradition, it is through this gate that Angel Jibril (Gabriel) would enter to deliver divine revelations to Prophet Muhammad ﷺ, particularly during moments of prophetic guidance and instruction. Though the exact location of the original gate has shifted slightly due to successive expansions and reconstructions—notably during the Ottoman and modern Saudi periods—it has always maintained its revered name and symbolic identity. Nestled among other ancient portals like Bab al-Nisa, Bab Jibril stands out with its decorative blend of late Ottoman and early 20th-century Saudi design, featuring arched stonework, geometric patterns, and inscribed panels. While it no longer functions as the main access point it once was, pilgrims continue to visit and recognize this gate for its deep historical and spiritual connection to the early days of Islam and the life of the Prophet ﷺ.",
      "image":"../images/madina/BabJibril/BabJibril1.jpg",
      "heroImage":"../images/madina/BabJibril/BabJibril6.jpg",
      "gallery": [ "../images/madina/BabJibril/BabJibril3.jpg","../images/madina/BabJibril/BabJibril4.jpg","../images/madina/BabJibril/BabJibril5.jpg","../images/madina/BabJibril/BabJibril6.jpg","../images/madina/BabJibril/BabJibril1.jpg"]
    },
    {
      "id": "bab-as-salam",
      "title": "Bab as-Salam",
      "shortDescription": "The “Gate of Peace,” one of the mosque’s largest Ottoman-era gates, located at the northwest corner of the old prayer.",
      "fullDescription": "Bab as-Salam (Gate of Peace) is one of the most famous and historically rich entrances of Masjid an-Nabawi, originally constructed during the caliphate of ʿUmar ibn al-Khattab (RA) in 642 CE on the mosque’s western wall. It served as a principal access point for early worshippers and travelers arriving in Madinah, symbolizing a greeting of peace upon entering the sacred space. Over the centuries, particularly during the Ottoman expansion, the gate became integrated into the extended prayer hall, and its orientation now faces the northwest. Despite the architectural changes, the gate retained its historic title, associated with the tradition of entering the mosque respectfully and sending salutations upon the Prophet ﷺ. During the modern Saudi renovations, Bab as-Salam was given a grander facade, complete with an elegant archway, ornate calligraphy, and decorative motifs that reflect a fusion of traditional Islamic design with modern craftsmanship. Today, it remains one of the most used entrances by pilgrims, especially those visiting the Rawdah Ash-Sharifah, and is widely regarded as a spiritual threshold into the sanctity of the Prophet’s Mosque",
      "image": "../images/madina/babassalam/babassalam1.jpg",
      "heroImage": "../images/madina/babassalam/babassalam5.jpg",
      "gallery": ["../images/madina/babassalam/babassalam3.jpg","../images/madina/babassalam/babassalam4.jpg","../images/madina/babassalam/babassalam5.jpg","../images/madina/babassalam/babassalam6.jpg","../images/madina/babassalam/babassalam1.jpg"]
    },
    {
      "id": "women-prayer-area",
      "title": "Women’s Prayer Area",
      "shortDescription": "Dedicated multi-level halls and galleries reserved for female worshippers, separated from the main hall by partitions.",
      "fullDescription": "In the modern expansions of Masjid an-Nabawi, special attention has been given to accommodating the needs of female worshippers through the construction of dedicated women’s prayer halls on the upper levels of the mosque. These areas are spacious, climate-controlled, and equipped with their own mihrab (prayer niche) and minbar (pulpit) to allow women to fully participate in congregational prayers in real-time with the male congregation below. While seamlessly integrated into the overall architectural design, these sections are enclosed by walls, glass panels, or decorative screens to ensure privacy and comfort in accordance with Islamic guidelines on gender interaction. In addition to the upper levels, designated ground-floor zones near the rear of the main prayer hall are also reserved for women, especially during Ramadan, Hajj season, and Friday prayers, when the mosque experiences high attendance. However, the Rawdah Ash-Sharifah, due to its limited space and sanctity, remains restricted to men, although special visiting hours for women have occasionally been arranged under regulated conditions. These enhancements reflect the ongoing efforts to ensure that women have dignified, accessible, and spiritually fulfilling spaces within Islam’s second holiest mosque.",
      "image": "../images/madina/womenprayerarea/womenprayerarea1.jpg",
      "heroImage":"../images/madina/womenprayerarea/women1.webp",
      "gallery": ["../images/madina/womenprayerarea/womenprayerarea3.jpg","../images/madina/womenprayerarea/womenprayerarea4.jpg","../images/madina/womenprayerarea/womenprayerarea5.jpg"]
    },
    {
      "id": "old-prayer-chamber",
      "title": "Al-Hujra ash-Sharifah (Old Prayer Chamber)",
      "shortDescription": "The Prophet’s private quarters (his house, where he lived with Aisha and passed away) now enclosed inside the mosque.",
      "fullDescription": "The “Sacred Chamber” was the room where Muhammad ﷺ lived during the final years of his life. Aisha and some wives resided here, and the Prophet ﷺ often prayed and taught inside it. He passed away in this chamber. Afterward, it was incorporated into Masjid an-Nabawi and later became part of the burial chamber. Today it is a small roofed room on the mosque’s eastern side, preserved through renovations but closed to general access.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "burial-chamber",
      "title": "Burial Chamber",
      "shortDescription": "Enclosed chamber under the Green Dome containing the graves of the Prophet ﷺ, Abu Bakr and Umar.",
      "fullDescription": "The Burial Chamber is the small marble-enclosed room beneath the Green Dome that houses the tombs of Prophet Muhammad ﷺ, Abu Bakr and Umar. Muhammad ﷺ is in the southeastern corner of this chamber, with Abu Bakr’s grave immediately behind him and Umar’s to one side. Aisha had permitted these burials to occur next to her husband, so no wall divides the graves. The chamber has simple marble walls and a grated gateway; visitors honor the Prophet by standing at its outer entrance and offering salutations.",
      "image": "",
      "heroImage": "",
      "gallery": []
    },
    {
      "id": "historical-architecture",
      "title": "Historical Architecture",
      "shortDescription": "The mosque’s structure reflects Ottoman, Mamluk and modern Saudi styles – e.g. Sultan Qalawun’s 13th-century domes, Ottoman minaret and minbar, and 20th-century expansions.",
      "fullDescription": "Al-Masjid an-Nabawi has been rebuilt and expanded many times. Key elements include the Mamluk-era Qalawun Dome (built 1279–80 CE), the Ottoman minbar of 1590 CE, and the massive concrete wings and minarets added by Saudi kings in the 20th century. Ottoman features like high arches and ornate tile work blend with simple modern expansions. The result is a layered historical tapestry: the modest original mosque gave way to an imperial mosque under the Ottomans, and today a sprawling multi-storied complex befitting one of Islam’s holiest sites.",
      "image": "",
      "heroImage": "",
      "gallery": []
    }
  ]
  